// Основне завдання, cтворити скрипт яки повинен виконувати наступне:
// запитати у користувача рік народження;
// запитати в нього, в якому місті він живе;
// запитати його улюблений вид спорту.
// При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

const birthYear = prompt("Введіть ваш рік народження:");
if (birthYear === null) {
    alert("Шкода, що Ви не захотіли ввести ваш рік народження.");
}
const city = prompt("В якому місті ви живете?");
if (city === null) {
    alert("Шкода, що Ви не захотіли ввести своє місто.");
}
const sport = prompt("Який ваш улюблений вид спорту?");
if (sport === null) {
    alert("Шкода, що Ви не захотіли ввести свій улюблений вид спорту.");
}
const currentYear = new Date().getFullYear();
const age = currentYear - birthYear;

// його вік;
// якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.

let cityMessage;
if (city.toLowerCase() === "київ") {
    cityMessage = "Ти живеш у столиці України.";
} else if (city.toLowerCase() === "вашингтон") {
    cityMessage = "Ти живеш у столиці США.";
} else if (city.toLowerCase() === "лондон") {
    cityMessage = "Ти живеш у столиці Великобританії.";
} else {
    cityMessage = `Ти живеш у місті ${city}.`;
}

// Додаткове завдання *
// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.

let sportMessage;
if (sport.toLowerCase() === "футбол") {
    sportMessage = "Шевченко";
} else if (sport.toLowerCase() === "бокс") {
    sportMessage = "Усіком";
} else if (sport.toLowerCase() === "греко-римська боротьба") {
    sportMessage = "Беленюком";
}

// Все це має бути відображено в одному вікні (алерті).
alert(`Вам ${age} років. ${cityMessage} Ваш улюблений вид спорту: ${sport}. Круто! Хочеш стати ${sportMessage}?`);

// Додаткове завдання
// Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .